//---------------------------------------------------------------------------
//Класс GUID - уникальный идентификатор записи

#ifndef GUIDH
#define GUIDH
//---------------------------------------------------------------------------
#include <Classes.hpp>
//---------------------------------------------------------------------------
class guid
{
private:
  GUID g;
  AnsiString p;
public:
  AnsiString __fastcall genGUID(void);
};
//---------------------------------------------------------------------------

#endif
